cypress/utils/requests/requests-body/ZWM_Test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:env="http://wholesale.telekom.de/ess/v4/envelope" xmlns:mes="http://wholesale.telekom.de/ess/v4/message">
    <soapenv:Header/>
    <soapenv:Body>

        <ns12:annehmenEntstoerauftragMeldungRequest xmlns:ns12="http://wholesale.telekom.de/ess/v4/envelope" xmlns:ns10="http://wholesale.telekom.de/ess/v4/assignment" xmlns:ns11="http://wholesale.telekom.de/ess/v4/action" xmlns:ns6="http://wholesale.telekom.de/ess/v4/support/internal" xmlns:ns7="http://wholesale.telekom.de/ess/v4/diagnose" xmlns:ns8="http://wholesale.telekom.de/ess/v4/support" xmlns:ns9="http://wholesale.telekom.de/ess/v4/message">
            <Control>
                <zeitstempel>2018-06-21T14:52:57.832+02:00</zeitstempel>
                <majorRelease>04</majorRelease>
                <minorRelease>00</minorRelease>
                <signaturId>
                    <issuer>cn=none</issuer>
                    <serial>0</serial>
                </signaturId>
            </Control>
            <ns9:EntstoerauftragMeldung xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns9:EntstoerauftragMeldungZWMType">
                <Kunde>
                    <Kundennummer>5920301990</Kundennummer>
                </Kunde>
                <Besteller>
                    <Kundennummer>2712000196</Kundennummer>
                </Besteller>
                <ExterneStoerungsnummer>{externeStoerungsnummer}</ExterneStoerungsnummer>
                <Entstoerauftragsnummer>{entstoerungsAuftragsnummer}</Entstoerauftragsnummer>
                <Geschaeftsfall>EST</Geschaeftsfall>
                <Vertragsnummer>284263306</Vertragsnummer>
                <Position>
                    <Meldungscode>0073</Meldungscode>
                    <Meldungstext>Information zum Auftrag</Meldungstext>
                </Position>
                <Bemerkung>Z1 an Außendienst übergeben</Bemerkung>
                <AnsprechpartnerLeistungserbringer>
                    <Name>Rainer K</Name>
                    <Rueckrufnummer>+49 800 1234567</Rueckrufnummer>
                    <Fax>+49 391 123456789</Fax>
                    <EMail>rk@telekom.de</EMail>
                </AnsprechpartnerLeistungserbringer>
            </ns9:EntstoerauftragMeldung>
        </ns12:annehmenEntstoerauftragMeldungRequest>

    </soapenv:Body>
</soapenv:Envelope>